Edragon/WCH/CH56x/official examples/UDISK_FAT_TCP/UDISK_FAT_TCP/PUB/CH563NET.H
#ifndef CH563NET_NUM_IP_REASSDATA
#define CH563NET_NUM_IP_REASSDATA             5                                 /* IP分段的长度 */
#endif

#ifndef CH563NET_TCP_MSS
#define CH563NET_TCP_MSS                      1460                              /* tcp MSS的大小*/
#endif

#ifndef CH563_MEM_HEAP_SIZE
#define CH563_MEM_HEAP_SIZE                   4600                              /* 内存堆大小 */
#endif

#ifndef CH563NET_NUM_ARP_TABLE
#define CH563NET_NUM_ARP_TABLE                16                                /* ARP列表个数 */
#endif

#ifndef CH563NET_MEM_ALIGNMENT
#define CH563NET_MEM_ALIGNMENT                4                                 /* 4字节对齐 */
#endif

#ifndef CH563NET_IP_REASS_PBUFS             
#if (CH563NET_NUM_POOL_BUF < 32)
#define CH563NET_IP_REASS_PBUFS               (CH563NET_NUM_POOL_BUF - 1)       /* IP分片的PBUF个数，最大为31 */
#else
#define CH563NET_IP_REASS_PBUFS               31       
#endif
#endif

#define CH563NET_MISC_CONFIG0                 ((MISCE_CFG0_TCP_SEND_COPY << 0) |\
                                               (MISCE_CFG0_TCP_RECV_COPY << 1) |\
                                               (MISCE_CFG0_TCP_OLD_DELETE << 2)|\
                                               (CH563NET_IP_REASS_PBUFS)<<3)
/* PHY 状态 */
#define PHY_DISCONN                           (1<<0)                            /* PHY断开 */
#define PHY_10M_FLL                           (1<<1)                            /* 10M全双工 */
#define PHY_10M_HALF                          (1<<2)                            /* 10M半双工 */
#define PHY_100M_FLL                          (1<<3)                            /* 100M全双工 */
#define PHY_100M_HALF                         (1<<4)                            /* 100M半双工 */
#define PHY_AUTO                              (1<<5)                            /* PHY自动模式，CMD10H_SET_PHY */
                                                                                
/* Socket 工作模式定义,协议类型 */                                                       
#define PROTO_TYPE_IP_RAW                     0                                 /* IP层原始数据 */
#define PROTO_TYPE_UDP                        2                                 /* UDP协议类型 */
#define PROTO_TYPE_TCP                        3                                 /* TCP协议类型 */
                                                                                
/* 中断状态 */                                                                  
/* 以下为GLOB_INT会产生的状态 */                                                
#define GINT_STAT_UNREACH                     (1<<0)                            /* 不可达中断*/
#define GINT_STAT_IP_CONFLI                   (1<<1)                            /* IP冲突*/
#define GINT_STAT_PHY_CHANGE                  (1<<2)                            /* PHY状态改变 */
#define GINT_STAT_SOCKET                      (1<<4)                            /* scoket 产生中断 */
                                                                                
/*以下为Sn_INT会产生的状态*/                                                    
#define SINT_STAT_RECV                        (1<<2)                            /* socket端口接收到数据或者接收缓冲区不为空 */
#define SINT_STAT_CONNECT                     (1<<3)                            /* 连接成功,TCP模式下产生此中断 */
#define SINT_STAT_DISCONNECT                  (1<<4)                            /* 连接断开,TCP模式下产生此中断 */
#define SINT_STAT_TIM_OUT                     (1<<6)                            /* ARP和TCP模式下会发生此中断 */

/* 错误码 */
#define CH563NET_ERR_SUCCESS                  0x00                              /* 命令操作成功 */
#define CH563NET_RET_ABORT                    0x5F                              /* 命令操作失败 */
#define CH563NET_ERR_BUSY                     0x10                              /* 忙状态，表示当前正在执行命令 */
#define CH563NET_ERR_MEM                      0x11                              /* 内存错误 */
#define CH563NET_ERR_BUF                      0x12                              /* 缓冲区错误 */
#define CH563NET_ERR_TIMEOUT                  0x13                              /* 超时 */
#define CH563NET_ERR_RTE                      0x14                              /* 路由错误*/
#define CH563NET_ERR_ABRT                     0x15                              /* 连接停止*/
#define CH563NET_ERR_RST                      0x16                              /* 连接复位 */
#define CH563NET_ERR_CLSD                     0x17                              /* 连接关闭/socket 在关闭状态*/
#define CH563NET_ERR_CONN                     0x18                              /* 无连接 */
#define CH563NET_ERR_VAL                      0x19                              /* 错误的值 */
#define CH563NET_ERR_ARG                      0x1a                              /* 错误的参数 */
#define CH563NET_ERR_USE                      0x1b                              /* 已经被使用 */
#define CH563NET_ERR_IF                       0x1c                              /* MAC错误  */
#define CH563NET_ERR_ISCONN                   0x1d                              /* 已连接 */
#define CH563NET_ERR_SOCKET_MEM               0X20                              /* Socket信息列表已满或者错误 */
#define CH563NET_ERR_UNSUPPORT_PROTO          0X21                              /* 不支持的协议类型 */
#define CH563NET_ERR_UNKNOW                   0xFA                              /* 未知错误 */

/* 不可达代码 */
#define UNREACH_CODE_HOST                     0                                 /* 主机不可达 */
#define UNREACH_CODE_NET                      1                                 /* 网络不可达 */
#define UNREACH_CODE_PROTOCOL                 2                                 /* 协议不可达 */
#define UNREACH_CODE_PROT                     3                                 /* 端口不可达 */
/*其他值请参考RFC792文档*/                                                      

/* TCP关闭参数 */
#define TCP_CLOSE_NORMAL                      0                                 /* 正常关闭，进行4此握手 */
#define TCP_CLOSE_RST                         1                                 /* 复位连接，并关闭  */
#define TCP_CLOSE_ABANDON                     2                                 /* CH563NET内部丢弃连接，不会发送任何终止报文 */

/* socket状态 */
#define  SOCK_STAT_CLOSED                     0X00                              /* socket关闭 */
#define  SOCK_STAT_OPEN                       0X05                              /* socket打开 */

/* TCP状态 */
#define TCP_CLOSED                            0                                 /* TCP连接 */
#define TCP_LISTEN                            1                                 /* TCP关闭 */
#define TCP_SYN_SENT                          2                                 /* SYN发送，连接请求 */
#define TCP_SYN_RCVD                          3                                 /* SYN接收，接收到连接请求 */
#define TCP_ESTABLISHED                       4                                 /* TCP连接建立 */
#define TCP_FIN_WAIT_1                        5                                 /* WAIT_1状态 */
#define TCP_FIN_WAIT_2                        6                                 /* WAIT_2状态 */
#define TCP_CLOSE_WAIT                        7                                 /* 等待关闭 */
#define TCP_CLOSING                           8                                 /* 正在关闭 */
#define TCP_LAST_ACK                          9                                 /* LAST_ACK*/
#define TCP_TIME_WAIT                         10                                /* 2MSL等待 */

/* sokcet信息表 */
typedef struct _SCOK_INF
{
    UINT32 IntStatus;                                                           /* 中断状态 */
    UINT32 SockIndex;                                                           /* Socket索引值 */
    UINT32 RecvStartPoint;                                                      /* 接收缓冲区的开始指针 */
    UINT32 RecvBufLen;                                                          /* 接收缓冲区长度 */
    UINT32 RecvCurPoint;                                                        /* 接收缓冲区的当前指针 */
    UINT32 RecvReadPoint;                                                       /* 接收缓冲区的读指针 */
    UINT32 RecvRemLen;                                                          /* 接收缓冲区的剩余长度 */
    UINT32 ProtoType;                                                           /* 协议类型 */
    UINT32 ScokStatus;                                                          /* 低字节Socket状态，次低字节为TCP状态，仅TCP模式下有意义 */
    UINT32 DesPort;                                                             /* 目的端口 */
    UINT32 SourPort;                                                            /* 源端口在IPRAW模式下为协议类型 */
    UINT8  IPAddr[4];                                                           /* Socket目标IP地址 32bit*/
    void *Resv1;                                                                /* 保留，内部使用，用于保存各个PCB */
    void *Resv2;                                                                /* 保留，内部使用，TCP Server使用 */
 // void (*RecvCallBack)(struct _SCOK_INF *socinf,UINT32 ipaddr,UINT16 port,UINT8 *buf,UINT32 len); /* 接收回调函数*/
    void (*AppCallBack)(struct _SCOK_INF *,UINT32 ,UINT16 ,UINT8 *,UINT32 ); /* 接收回调函数*/

}SOCK_INF;

/* CH563全局信息 */
struct _CH563_SYS
{
    UINT8  IPAddr[4];                                                           /* CH563IP地址 32bit */
    UINT8  GWIPAddr[4];                                                         /* CH563网关地址 32bit */
    UINT8  MASKAddr[4];                                                         /* CH563子网掩码 32bit */
    UINT8  MacAddr[8];                                                          /* CH563MAC地址 48bit */
    UINT8  UnreachIPAddr[4];                                                    /* 不可到达IP */
    UINT32 RetranCount;                                                         /* 重试次数 默认为10次 */
    UINT32 RetranPeriod;                                                        /* 重试周期,单位MS,默认200MS */
    UINT32 PHYStat;                                                             /* CH563PHY状态码 8bit */
    UINT32 CH563Stat;                                                           /* CH563的状态 ，包含是否打开等 */ 
    UINT32 MackFilt;                                                            /* CH563 MAC过滤，默认为接收广播，接收本机MAC 8bit */
    UINT32 GlobIntStatus;                                                       /* 全局中断 */
    UINT32 UnreachCode;                                                         /* 不可达 */
    UINT32 UnreachProto;                                                        /* 不可达协议 */
    UINT32 UnreachPort;                                                         /* 不可到达端口 */
    UINT32 SendFlag;
};
