Edragon/WCH/CH56x/official examples/UDISK_FAT_TCP/UDISK_FAT_TCP/PUB/CH563NET.H
UINT8 CH563NET_GetPHYStatus(void);                                              /* 获取PHY状态 */
                                                                                
UINT8 CH563NET_QueryGlobalInt(void);                                             /* 查询全局中断 */
                                                                                
UINT8 CH563NET_GetGlobalInt (void);                                             /* 读全局中断并将全局中断清零 */
                                                                                
void CH563NET_OpenMac(void);                                                    /* 打开MAC */
                                                                                
void CH563NET_CloseMac(void);                                                   /* 关闭MAC */
                                                                                
UINT8 CH563NET_SocketCreat(UINT8 *socketid,SOCK_INF *socinf);                   /* 创建socket */
                                                                                
UINT8 CH563NET_SocketSend(UINT8 socketid,UINT8 *buf,UINT32 *len);               /* Socket发送数据 */
                                                                                
UINT8 CH563NET_SocketRecv(UINT8 socketid,UINT8 *buf,UINT32 *len);               /* Socket接收数据 */
                                                                                
UINT8 CH563NET_GetSocketInt(UINT8 sockedid);                                    /* 获取socket中断并清零 */
                                                                                
UINT32 CH563NET_SocketRecvLen(UINT8 socketid,UINT32 *bufaddr);                  /* 获取socket接收长度 */
                                                                                
UINT8 CH563NET_SocketConnect(UINT8 socketid);                                   /* TCP连接*/
                                                                                
UINT8 CH563NET_SocketListen(UINT8 socindex);                                    /* TCP监听 */
                                                                                
UINT8 CH563NET_SocketClose(UINT8 socindex,UINT8 flag);                          /* 关闭连接 */

void CH563NET_ModifyRecvBuf(UINT8 sockeid,UINT32 bufaddr,UINT32 bufsize);       /* 修改接收缓冲区 */

UINT8 CH563NET_SocketUdpSendTo(UINT8 socketid, UINT8 *buf, UINT32 *slen,UINT8 *sip,UINT16 port);/* 向指定的目的IP，端口发送UDP包 */

UINT8 CH563NET_Aton(const UINT8 *cp, UINT8 *addr);                              /* ASCII码地址转网络地址 */
                                                                                
UINT8 *CH563NET_Ntoa(UINT8 *ipaddr);                                            /* 网络地址转ASCII地址 */
                                                                                
UINT8 CH563NET_SetSocketTTL(UINT8 socketid, UINT8 ttl);                         /* 设置socket的TTL */
                                                                                
void CH563NET_RetrySendUnack(UINT8 socketid);                                   /* TCP重传 */

UINT8 CH563NET_QueryUnack(SOCK_INF  *sockinf,UINT32 *addrlist,UINT16 lislen)    /* 查询未发送成功的数据包 */;

UINT8 CH563NET_DHCPStart(UINT8(* usercall)(UINT8 status,void *));               /* DHCP启动 */
                                                                                
UINT8 CH563NET_DHCPStop(void);                                                  /* DHCP停止 */

void CH563NET_InitDNS(UINT8 *dnsip,UINT16 port);                                /* DNS初始化 */

UINT8 CH563NET_GetHostName(const char *hostname,UINT8 *addr,dns_callback found,void *arg);/* DNS获取主机名 */

#ifdef __cplusplus
}
#endif
#endif


